Revit 2027 API
SteelElementProperties.AddFabricationInformationForRevitElements Method
 This method adds fabrication information to the given elements.
Namespace: Autodesk.Revit.DB.Steel
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> AddFabricationInformationForRevitElements(
	Document aDoc,
	IList<ElementId> elementIds
)
Public Shared Function AddFabricationInformationForRevitElements (
	aDoc As Document,
	elementIds As IList(Of ElementId)
) As IList(Of ElementId)
public:
static IList<ElementId^>^ AddFabricationInformationForRevitElements(
	Document^ aDoc,
	IList<ElementId^>^ elementIds
)
static member AddFabricationInformationForRevitElements :
        aDoc : Document *
        elementIds : IList<ElementId> -> IList<ElementId>
Parameters
aDoc Document
 Document containing the given elements ids.
elementIds IList<ElementId>
 Ids of the elements to which we want to add fabrication information.
Return Value
IList<ElementId>
 Ids of the elements for which we couldn't add fabrication information.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 You can add fabrication information to connections, beams, columns, braces, walls, floors and foundations.
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace